{
  "data": [
  {
    "type": "stories",
    "id": "1",
    "attributes": {
        "author": "Norman",
        "year": "2008",
        "github": "https://github.com/nkoehring",
        "image": "men-camera-round.jpg",
        "testimony": [
          {
            "title": "My background",
            "content": "I studied applied computer sciences and before that made an apprenticeship in a similar direction. So for me it was always clear that I end up being a programmer."
          },
          {
            "title": "Interest in development",
            "content": "I got a programming handbook when I was ten. I was always interested computers as a child although nobody in my family or friend circle shared my interest. When my parents finally got me an old, used C64, it came with a ton of floppy discs and a programming handbook. Nothing shaped my future as much as this I think."
          },
          {
            "title": "My studies",
            "content": "I'm a autodidact so I didn't really follow a path. But I started this apprenticeship which actually allowed me to spend a lot of time for self learning. As a student I spent more time on my own projects and started working as freelancer already. I think that helped me achieving a lot because I came out of studies with working experience."
          },
          {
            "title": "My first developer role",
            "content": "I don't really remember unfortunately. I only know that it was for a project funded by another university and it involved a lot of Python and XML. I probably found it on one of the job boards we had at the university."
          },
          {
            "title": "My recommendations",
            "content": "If you love programming as a hobby, show that passion to everyone and never let the day-to-day work cripple it. You're getting paid for what you love so do what you love."
          }
        ]
      }
    },
    {
      "type": "stories",
      "id": "2",
      "attributes": {
        "author": "Dieter",
        "year": "2019",
        "linkedin": "https://www.linkedin.com/in/dieter-pankratz/",
        "image": "dieter-pankratz.png",
        "testimony": [
          {
            "title": "My background",
            "content": "I have a background in electrical engineering. While I was in my master’s studies I started a music project with friends. I was responsible for website, live streams and social media. I really enjoyed the creative work and so I dropped out of university, took a full-time job in a tapas bar to save money together for a coding bootcamp. Then I moved to Berlin and here I am: D"
          },
          {
            "title": "Interest in development",
            "content": "I started with WordPress and really enjoyed to create something from scratch. But after a while I felt like I wanted to escape the boundaries of WordPress. So I started to learn the fundamentals (HTML, CSS & JS) with online resources. The web has gone through an evolution so when you start learning it today it can be overwhelming. Also I wanted to go on this journey with other people so I decided to attend a coding bootcamp."
          },
          {
            "title": "My studies",
            "content": "I started with Udemy and Youtube tutorials. But I really learned to code with Le Wagon Coding Bootcamp. Wes Bos (wesbos.com) has very good JS courses that I took. For people who want to dig deeper in frontend development I can recommend the 'Frontend Handbook': https://frontendmasters.com/books/front-end-handbook/2019/"
          },
          {
            "title": "My first developer role",
            "content": "I am currently working as a freelance teaching assistant at Le Wagon and building my portfolio. Due to COVID19 many HR's are on hold so I try to practice and learn on these days. I’m looking to find a full-time frontend dev role in Berlin."
          },
          {
            "title": "My recommendations",
            "content": "1.In the beginning 'googling' feels like cheating, but it's not! 2.Ask questions! I think better developers a developers who ask more questions and there are no stupid questions. 3.Failing is part of the process. You cannot get around it."
          }
        ]
      }
    },
    {
      "type": "stories",
      "id": "3",
      "attributes": {
        "author": "Florentin",
        "year": "2017",
        "image": "purple-flower-round.jpg",
        "testimony": [
          {
            "title": "My background",
            "content": "I had a scientific baccalaureate, and a two-year degree in Computer Science (Digital system with computer and network option) (SNIR)"
          },
          {
            "title": "Interest in development",
            "content": "I gained interest when I started learning and coding apps. At that time I was coding in Android and Java."
          },
          {
            "title": "My studies",
            "content": "I started after my A level (baccalaureate) with a two-year degree in Digital System and Network. I am at the moment a Computer Science student. I'm not sure yet what path to choose, because I'm getting more amd more interested in coding video games!"
          },
          {
            "title": "My first developer role",
            "content": "My first job was an internship as a Web Developer. It helped me a lot to figure out the role I really want in the future."
          },
          {
            "title": "My recommendations",
            "content": "There is a lot of domain possible as a developer. Try them all, maybe you will find the perfect one for you!"
          }
        ]
      }
    },
    {
      "type": "stories",
      "id": "4",
      "attributes": {
        "author": "Mailys",
        "year": "2010",
        "image": "splatter-round.jpg",
        "testimony": [
          {
            "title": "My background",
            "content": "I directly chose to study programming after high school!"
          },
          {
            "title": "Interest in development",
            "content": "My love and skills for mathematics and logic in high school made me choose a science cursus. My parents also supported me to take this path because of the big demand in developers in France (and worldwide, developers are wanted like rockstars!)."
          },
          {
            "title": "My studies",
            "content": "I did a two year degree in Network and Telecommunication, then a Bachelor, and finally a Master in Architecture, Software & Web Engineering."
          },
          {
            "title": "My first developer role",
            "content": "Thanks to an internship during my Master, I met colleagues who were working for different software companies (the beginning of my career network). That's how I had a referral by a colleague, to the company I joined."
          },
          {
            "title": "My recommendations",
            "content": "Please, follow the EGOLESS programming principles: Always stay humble and don't blame other devs. Don't be ashamed about asking questions (especially when you're a beginner). Thank and quote your colleagues if they have been part of the work. Don't rest on your laurels. Be curious, try new technologies, don't be trapped in a technology for too long."
          }
        ]
      }
    },
    {
      "type": "stories",
      "id": "5",
      "attributes": {
        "author": "Sean",
        "year": "2011",
        "image": "seanb.jpg",
        "testimony": [
          {
            "title": "My background",
            "content": "Computer science student. Initially I wanted to study architecture in college but the admission program required a portfolio that year for the first time in the history of the program. I didn't have one, so I became a CS major instead. I grew up building skate ramps which require money for lumber. So the idea of building something digital without having to buy materials was exciting to me."
          },
          {
            "title": "Interest in development",
            "content": "My family got AOL in like 1998 and a friend of mine was making dumb little webpages about Austin Powers on Angelfire. It was amusing so I asked him how he made it and he said: Do you know HTML? And I thought he meant Hotmail, which I think is incorrect. It was really just a way for me to publish some dumb ideas I had as a kid."
          },
          {
            "title": "My studies",
            "content": "I used search engines to find resources on how to build stuff I didn't know how to do. Lotsa copying and pasting and then tweaking. This is back in the days when the <table> tag was used for layouts so the bar was very low. Styling was also done via html tag attributes and all markup was in caps. If Javascript was in the picture, it was to do something annoying like making snowflakes fall down the screen or for a button to avoid the cursor when you got near it, haha. Sad. I learned database architecture and advanced scripting in college."
          },
          {
            "title": "My first developer role",
            "content": "My uncle was getting press for his work with cardiology students that he instructed to use iPods to repeatedly listen to heart murmurs in order to memorize them; something called cardiac auscultation in the medical field. The technique even had a write up in Time Magazine. Being my uncle and all, he's been supportive of me for a long time, so he hired me one summer in college to build a Windows desktop application to quiz the med students by playing a heart murmur, asking them to identify it, and then grading them. I got paid with a new iPod. I wrote it in VB.NET while sitting at my parent's kitchen counter in Summer 2006. After college, I got my first job through a recruiter, in a junior database administrator role."
          },
          {
            "title": "My recommendations",
            "content": "There are so many good resources around now that I wish I had when I was learning. Like YouTube. Dan Shiffman (The Coding Train) is amazing for creative coding tutorials. Talks tend to be way more digestible for me than reading, and they can turn you onto new topics. Most conferences publish the talks afterwards so this is the cheap and flexible way to do it. Build something on your own that's not a part of your work duties. There are a ton of tasks that you will never do in the course of day to day work but are crucial to understanding what you're working with. Like building a complex application from scratch. Lastly, have a healthy amount of skepticism. Don't assume your colleagues necessarily know the best way. It will seem like that starting out but no one knows it all, so double check stuff, and you'll learn a lot this way too. If you're having a hard time, it's okay to identify and dwell on what you don't like about something. In turn, it's helped me identify what I actually do like. Oh, and get into automated testing as early as possible, lol."
          }
        ]
      }
    }
  ]
}
